{"_default": {"1": {"subject": "Kamala Devi Harris", "facts": [["was born on October 20, 1964", "7bc5b6dc-db95-41b5-a5bf-18bfce7a580b"], ["is an American politician and attorney", "7bc5b6dc-db95-41b5-a5bf-18bfce7a580b"], ["serves as the U.S. vice president alongside President Joe Biden since 2021", "7bc5b6dc-db95-41b5-a5bf-18bfce7a580b"], ["is the first female vice president in U.S. history", "7bc5b6dc-db95-41b5-a5bf-18bfce7a580b"], ["is both the first African American and the first Asian American vice president", "7bc5b6dc-db95-41b5-a5bf-18bfce7a580b"], ["served as a U.S. senator from California between 2017 and 2021", "7bc5b6dc-db95-41b5-a5bf-18bfce7a580b"], ["also served as the attorney general of California", "7bc5b6dc-db95-41b5-a5bf-18bfce7a580b"], ["is the Democratic Party's presidential nominee for the 2024 U.S. presidential election", "7bc5b6dc-db95-41b5-a5bf-18bfce7a580b"]]}, "2": {"subject": "Patrick Lehman", "facts": [["earned Bachelor of Science in Computer Engineering and Minor in Biology from University of Florida", "a4e6ed45-47f0-471c-a742-1048a87efbc8"], ["studied Courses including Machine Learning Fundamentals, Signals and Systems, Data Structures and Algorithms, Computational Linear Algebra, Natural Language Processing, Operating Systems, Digital Design, Digital Logic and Systems, Microprocessor Applications at University of Florida.", "a4e6ed45-47f0-471c-a742-1048a87efbc8"], ["worked as Machine Learning Engineer Intern at Ford Motor Company from March to August 2024", "a4e6ed45-47f0-471c-a742-1048a87efbc8"], ["analyzed Global Analytics on Plant Efficiency and Vehicle Warranty Usage to Derive Models for Car Defect Forecasting and Determine Metrics of Focus during Internship at Ford.", "a4e6ed45-47f0-471c-a742-1048a87efbc8"], ["discovered improperly calculated metrics by experimentally determining their lack of utility and successfully endorsed their replacement", "a4e6ed45-47f0-471c-a742-1048a87efbc8"], ["helped discover new metrics that more accurately determine warranty expenditure and vehicle defect rates", "a4e6ed45-47f0-471c-a742-1048a87efbc8"], ["worked as Algorithm Engineering Intern at Neurava from May to August 2023", "a4e6ed45-47f0-471c-a742-1048a87efbc8"], ["improved feature information capture by 358% through automated calculation of energy-entropy ratio for various wavelets during time at Neurava.", "a4e6ed45-47f0-471c-a742-1048a87efbc8"], ["analyzed biological signals using continuous transformers, decision trees, and wavelet transforms at Neurava.", "a4e6ed45-47f0-471c-a742-1048a87efbc8"], ["automated discovery of new and efficient epilepsy detection algorithms by developing feature extraction and model validation pipeline", "a4e6ed45-47f0-471c-a742-1048a87efbc8"], ["earned a Bachelor of Science in Computer Engineering and a Minor in Biology from the University of Florida.", "6bb40060-a843-48b2-802f-d927e9d9eb60"], ["is currently pursuing further studies at the University of Florida, expected to finish between August 2020 and December 2024.", "6bb40060-a843-48b2-802f-d927e9d9eb60"], ["completed coursework in Machine Learning Fundamentals, Signals and Systems, Data Structures and Algorithms, Computational Linear Algebra, Natural Language Processing, Operating Systems, Digital Design, Digital Logic and Systems, and Microprocessor Applications at the University of Florida.", "6bb40060-a843-48b2-802f-d927e9d9eb60"], ["interned as a Machine Learning Engineer at Ford Motor Company from March to August 2024.", "6bb40060-a843-48b2-802f-d927e9d9eb60"], ["developed car defect forecasting models using global analytics on plant efficiency and vehicle warranty usage data while interning at Ford Motor Company.", "6bb40060-a843-48b2-802f-d927e9d9eb60"], ["discovered inaccurately calculated metrics through experimentation, advocating for their replacement successfully at Ford Motor Company.", "6bb40060-a843-48b2-802f-d927e9d9eb60"], ["contributed significantly in discovering new metrics that more accurately determined warranty expenditure and vehicle defect rates while interning at Ford Motor Company.", "6bb40060-a843-48b2-802f-d927e9d9eb60"], ["interned as an Algorithm Engineer at Neurava from May to August 2023.", "6bb40060-a843-48b2-802f-d927e9d9eb60"], ["enhanced feature information capture by 358% by automating the calculation of energy-entropy ratio for various wavelets while interning at Neurava.", "6bb40060-a843-48b2-802f-d927e9d9eb60"], ["analyzed biological signals using Continuous Transformers, Decision Trees, and Wavelet Transforms while interning at Neurava.", "6bb40060-a843-48b2-802f-d927e9d9eb60"], ["automated the development of efficient epilepsy detection algorithms by establishing a feature extraction and model validation pipeline while interning at Neurava.", "6bb40060-a843-48b2-802f-d927e9d9eb60"], ["pursuing a Bachelor of Science in Computer Engineering with a Minor in Biology at the University of Florida in Gainesville, FL.", "1709d71c-f691-4430-aa64-952029f3449f"], ["Expected graduation: August 2020 - December 2024", "1709d71c-f691-4430-aa64-952029f3449f"], ["Completed courses: Software (Machine Learning Fundamentals, Signals and Systems, Data Structures and Algorithms, Computational Linear Algebra, Natural Language Processing).", "1709d71c-f691-4430-aa64-952029f3449f"], ["Hardware courses completed: Digital Design, Digital Logic and Systems, Microprocessor Applications.", "1709d71c-f691-4430-aa64-952029f3449f"], ["Interned at Ford Motor Company from March 2024 to August 2024; analyzed global analytics on plant efficiency and vehicle warranty usage (car defect forecasting models, metrics of focus).", "1709d71c-f691-4430-aa64-952029f3449f"], ["Served as an Algorithm Engineering Intern at Neurava in Baltimore, MD, from May 2023 to August 2023; improved feature information capture by 358% (automated calculation of energy-entropy ratio for various wavelets).", "1709d71c-f691-4430-aa64-952029f3449f"], ["Analyzed biological signals using Continuous Transformers, Decision Trees, and Wavelet Transforms.", "1709d71c-f691-4430-aa64-952029f3449f"], ["Automated discovery of new and efficient epilepsy detection algorithms as a Machine Learning Research Intern from November 2023 onwards; developed feature extraction and model validation pipeline.", "1709d71c-f691-4430-aa64-952029f3449f"], ["is a student at the University of Florida in Gainesville, FL", "194765ff-d567-4844-b74f-9fe90d5b7997"], ["studies for a Bachelor of Science in Computer Engineering with a Minor in Biology", "194765ff-d567-4844-b74f-9fe90d5b7997"], ["has completed coursework in Machine Learning Fundamentals, Signals and Systems, Data Structures and Algorithms, Computational Linear Algebra, Natural Language Processing, Operating Systems, Digital Design, Digital Logic and Systems, and Microprocessor Applications", "194765ff-d567-4844-b74f-9fe90d5b7997"], ["interned at Ford Motor Company as a Machine Learning Engineer from March to August 2024", "194765ff-d567-4844-b74f-9fe90d5b7997"], ["worked on global analytics for plant efficiency and vehicle warranty usage, creating models for car defect forecasting and identifying metrics of focus during his internship at Ford Motor Company", "194765ff-d567-4844-b74f-9fe90d5b7997"], ["improved feature information capture by automating calculation of energy-entropy ratio for various wavelets, analyzed biological signals using Continuous Transformers, Decision Trees, and Wavelet Transforms, and automated the discovery of new epilepsy detection algorithms through a feature extraction and model validation pipeline during his internship at Neurava", "194765ff-d567-4844-b74f-9fe90d5b7997"], ["is a student at the University of Florida in Gainesville, FL.", "cea94a29-3746-4c9e-8c8d-79a0968cda55"], ["is pursuing a Bachelor of Science in Computer Engineering with a Minor in Biology.", "cea94a29-3746-4c9e-8c8d-79a0968cda55"], ["has experience as a Machine Learning Engineer Intern at Ford Motor Company in Dearborn, MI.", "cea94a29-3746-4c9e-8c8d-79a0968cda55"], ["analyzed global analytics on plant efficiency and vehicle warranty usage to derive models for car defect forecasting and determine metrics of focus.", "cea94a29-3746-4c9e-8c8d-79a0968cda55"], ["discovered improperly calculated metrics and successfully endorsed their replacement.", "cea94a29-3746-4c9e-8c8d-79a0968cda55"], ["helped discover new metrics that more accurately determine warranty expenditure and vehicle defect rates.", "cea94a29-3746-4c9e-8c8d-79a0968cda55"], ["worked as an Algorithm Engineering Intern at Neurava in Baltimore, MD.", "cea94a29-3746-4c9e-8c8d-79a0968cda55"], ["improved feature information capture by 358% through the automated calculation of energy-entropy ratio for various wavelets.", "cea94a29-3746-4c9e-8c8d-79a0968cda55"], ["analyzed biological signals using Continuous Transformers, Decision Trees, and Wavelet Transforms.", "cea94a29-3746-4c9e-8c8d-79a0968cda55"], ["automated the discovery of new and efficient epilepsy detection algorithms by developing a feature extraction and model validation pipeline.", "cea94a29-3746-4c9e-8c8d-79a0968cda55"], ["earned a Bachelor of Science in Computer Engineering and a Minor in Biology from the University of Florida", "9afd3320-3c96-4587-941a-2b170b9b8456"], ["is currently pursuing further studies at the University of Florida, from August 2020 to December 2024.", "9afd3320-3c96-4587-941a-2b170b9b8456"], ["interned as a Machine Learning Engineer at Ford Motor Company between March and August 2024", "9afd3320-3c96-4587-941a-2b170b9b8456"], ["performed analyses on plant efficiency and vehicle warranty usage to develop car defect forecasting models at Ford Motor Company.", "9afd3320-3c96-4587-941a-2b170b9b8456"], ["identified inaccurately calculated metrics through experimentation and advocated for their replacement successfully at Ford Motor Company.", "9afd3320-3c96-4587-941a-2b170b9b8456"], ["contributed to the discovery of new metrics that more accurately determined warranty expenditure and vehicle defect rates at Ford Motor Company.", "9afd3320-3c96-4587-941a-2b170b9b8456"], ["interned as an Algorithm Engineering Intern at Neurava from May to August 2023", "9afd3320-3c96-4587-941a-2b170b9b8456"], ["enhanced feature information capture by 358% through automating the calculation of energy-entropy ratio for different wavelets at Neurava.", "9afd3320-3c96-4587-941a-2b170b9b8456"], ["conducted analyses of biological signals using Continuous Transformers, Decision Trees, and Wavelet Transforms", "9afd3320-3c96-4587-941a-2b170b9b8456"], ["automated the development of new and efficient epilepsy detection algorithms by creating a feature extraction and model validation pipeline.", "9afd3320-3c96-4587-941a-2b170b9b8456"], ["attends University of Florida in Gainesville, FL", "315c7dac-9d96-49d1-8f0f-e43dead89e3a"], ["earned a Bachelor of Science in Computer Engineering with a Minor in Biology at the University of Florida", "315c7dac-9d96-49d1-8f0f-e43dead89e3a"], ["is expected to graduate December 2024 from the University of Florida", "315c7dac-9d96-49d1-8f0f-e43dead89e3a"], ["was employed by Ford Motor Company in Dearborn, MI as a Machine Learning Engineer Intern", "315c7dac-9d96-49d1-8f0f-e43dead89e3a"], ["worked as an Algorithm Engineering Intern at Neurava in Baltimore, MD", "315c7dac-9d96-49d1-8f0f-e43dead89e3a"], ["improved feature information capture by 358% through automated calculation of energy-entropy ratio for various wavelets", "315c7dac-9d96-49d1-8f0f-e43dead89e3a"], ["utilized Continuous Transformers, Decision Trees, and Wavelet Transforms for the analysis of biological signals", "315c7dac-9d96-49d1-8f0f-e43dead89e3a"], ["developed a feature extraction and model validation pipeline for efficient epilepsy detection algorithm discovery at Neurava in Baltimore, MD", "315c7dac-9d96-49d1-8f0f-e43dead89e3a"], ["Obtained a Bachelor of Science in Computer Engineering and a Minor in Biology from the University of Florida.", "db3f5745-379f-4410-be68-e4eb772acdbc"], ["is Currently Pursuing his Degree from August 2020 to December 2024.", "db3f5745-379f-4410-be68-e4eb772acdbc"], ["Analyzing Biological Signals using Continuous Transformers, Decision Trees, and Wavelet Transforms.", "db3f5745-379f-4410-be68-e4eb772acdbc"], ["Automated the Discovery of New and Efficient Epilepsy Detection Algorithms by Developing a Feature Extraction and Model Validation Pipeline.", "db3f5745-379f-4410-be68-e4eb772acdbc"], ["Worked as a Machine Learning Engineer Intern at Ford Motor Company from March 2024 to August 2024.", "db3f5745-379f-4410-be68-e4eb772acdbc"], ["Derived Models for Car Defect Forecasting and Determined Metrics of Focus.", "db3f5745-379f-4410-be68-e4eb772acdbc"], ["Discovered Improperly Calculated Metrics by Experimenting and Replacing Them Successfully.", "db3f5745-379f-4410-be68-e4eb772acdbc"], ["Helped Discover New Metrics that More Accurately Determine Warranty Expenditure and Vehicle Defect Rates.", "db3f5745-379f-4410-be68-e4eb772acdbc"], ["Worked as an Algorithm Engineering Intern at Neurava from May 2023 to August 2023.", "db3f5745-379f-4410-be68-e4eb772acdbc"], ["Improved Feature Information Capture by 358% through the Automated Calculation of Energy-Entropy Ratio for Various Wavelets.", "db3f5745-379f-4410-be68-e4eb772acdbc"], ["earned a Bachelor of Science in Computer Engineering and minored in Biology at the University of Florida.", "463f9ecd-f158-4fd1-b2b4-c35eb30f628f"], ["took courses such as Software: Machine Learning Fundamentals, Signals and Systems, Data Structures and Algorithms, Computational Linear Algebra, Natural Language Processing, Operating Systems, Hardware: Digital Design, Digital Logic and Systems, Microprocessor Applications at the University of Florida.", "463f9ecd-f158-4fd1-b2b4-c35eb30f628f"], ["interned as a Machine Learning Engineer at Ford Motor Company from March 2024 to August 2024.", "463f9ecd-f158-4fd1-b2b4-c35eb30f628f"], ["analyzed global analytics on plant efficiency and vehicle warranty usage for car defect forecasting models and determined metrics of focus during his internship at Ford Motor Company.", "463f9ecd-f158-4fd1-b2b4-c35eb30f628f"], ["identified improperly calculated metrics and advocated for their replacement successfully during his internship at Ford Motor Company.", "463f9ecd-f158-4fd1-b2b4-c35eb30f628f"], ["contributed to discovering new metrics that accurately determine warranty expenditure and vehicle defect rates during his internship at Ford Motor Company.", "463f9ecd-f158-4fd1-b2b4-c35eb30f628f"], ["interned as an Algorithm Engineer at Neurava from May 2023 to August 2023.", "463f9ecd-f158-4fd1-b2b4-c35eb30f628f"], ["enhanced feature information capture by 358% through automating the calculation of energy-entropy ratio for various wavelets at Neurava.", "463f9ecd-f158-4fd1-b2b4-c35eb30f628f"], ["applied Continuous Transformers, Decision Trees, and Wavelet Transforms to analyze biological signals at Neurava.", "463f9ecd-f158-4fd1-b2b4-c35eb30f628f"], ["automated the development of efficient epilepsy detection algorithms by creating a feature extraction and model validation pipeline at Neurava.", "463f9ecd-f158-4fd1-b2b4-c35eb30f628f"], ["has contact information including phone number (904-307-1163), email address (patricklehman2000@gmail.com), LinkedIn profile (www.linkedin.com/in/pml2000/), and GitHub account (github.com/plehman2000)", "e9162b08-f3cd-4d4d-9023-b50bbd23c0db"], ["holds a Bachelor of Science in Computer Engineering and a Minor in Biology from the University of Florida, Gainesville", "e9162b08-f3cd-4d4d-9023-b50bbd23c0db"], ["attended school from August 2020 to December 2024", "e9162b08-f3cd-4d4d-9023-b50bbd23c0db"], ["took courses including Machine Learning Fundamentals, Signals and Systems, Data Structures and Algorithms, Computational Linear Algebra, Natural Language Processing, Operating Systems, Digital Design, Digital Logic and Systems, and Microprocessor Applications", "e9162b08-f3cd-4d4d-9023-b50bbd23c0db"], ["worked as a Machine Learning Engineer Intern at Ford Motor Company from March 2024 to August 2024, analyzing global analytics on plant efficiency and vehicle warranty usage to derive models for car defect forecasting and determine metrics of focus", "e9162b08-f3cd-4d4d-9023-b50bbd23c0db"], ["served as an Algorithm Engineering Intern at Neurava from May 2023 to August 2023, improving feature information capture by 358% through the automated calculation of energy-entropy ratio for various wavelets, analyzing biological signals using Continuous Transformers, Decision Trees, and Wavelet Transforms, and automating the discovery of new and efficient epilepsy detection algorithms by developing a feature extraction and model validation pipeline", "e9162b08-f3cd-4d4d-9023-b50bbd23c0db"], ["was a Machine Learning Research Intern from November 2022 to April 2023 (the exact details are not specified)", "e9162b08-f3cd-4d4d-9023-b50bbd23c0db"]]}, "3": {"subject": "Fire Neural Network", "facts": [["was utilized in Gainesville, FL in April 2023", "a4e6ed45-47f0-471c-a742-1048a87efbc8"], ["optimized model inference techniques, resulting in a 4.5x increase in model throughput.", "a4e6ed45-47f0-471c-a742-1048a87efbc8"], ["utilized Pytorch Lightning and Weights and Biases to create an automated pipeline that determined the best hyperparameters for a Vision Transformer used for image segmentation in April 2023.", "6bb40060-a843-48b2-802f-d927e9d9eb60"], ["produced internal tools for associating satellite images with related geoJSON data, creating files compatible with mapping software like ArcGIS and QGIS.", "6bb40060-a843-48b2-802f-d927e9d9eb60"], ["leveraged Pytorch Lightning and Weights and Biases in April 2023 to establish an automated pipeline that experimentally discerned the optimal hyperparameters for a Vision Transformer deployed in image segmentation tasks.", "1709d71c-f691-4430-aa64-952029f3449f"], ["employed Pytorch Lightning and Weights and Biases to develop an automated pipeline that experimentally discerned the ideal hyperparameters for a Vision Transformer applied to image segmentation", "194765ff-d567-4844-b74f-9fe90d5b7997"], ["used Pytorch Lightning and Weights and Biases to produce an automated pipeline determining best Vision Transformer hyperparameters for image segmentation in April 2023.", "cea94a29-3746-4c9e-8c8d-79a0968cda55"], ["developed tools associating satellite images with geoJSON data for compatibility with mapping software such as ArcGIS and QGIS.", "cea94a29-3746-4c9e-8c8d-79a0968cda55"], ["created an educational web app called Educatus using NextJS for providing study/research utilities to students.", "cea94a29-3746-4c9e-8c8d-79a0968cda55"], ["utilized Pytorch Lightning and Weights and Biases in April 2023, creating an automated pipeline that determined the best hyperparameters for a Vision Transformer used for image segmentation.", "9afd3320-3c96-4587-941a-2b170b9b8456"], ["optimized model inference, increasing model throughput by 4.5x.", "9afd3320-3c96-4587-941a-2b170b9b8456"], ["utilized Pytorch Lightning and Weights and Biases for an automated pipeline that determined optimal Vision Transformer hyperparameters for image segmentation.", "16cf2c16-2c86-488c-84f4-934364663f26"], ["enhanced model inference efficiency by increasing throughput by 4.5x.", "16cf2c16-2c86-488c-84f4-934364663f26"], ["utilized Pytorch Lightning and Weights and Biases to create an automated pipeline that experimentally determined the best Vision Transformer hyperparameters for image segmentation in April 2023.", "315c7dac-9d96-49d1-8f0f-e43dead89e3a"], ["produced internal tools for associating satellite images with related geoJSON data, increasing model throughput by 4.5x and producing files compatible with mapping software like ArcGIS and QGIS.", "315c7dac-9d96-49d1-8f0f-e43dead89e3a"], ["deployed Pytorch Lightning and Weights and Biases in April 2023 to develop an automated pipeline that identified the optimal hyperparameters for a Vision Transformer applied to image segmentation.", "463f9ecd-f158-4fd1-b2b4-c35eb30f628f"], ["generated internal tools capable of linking satellite images with relevant geoJSON data, producing files compatible with prominent mapping software such as ArcGIS and QGIS.", "463f9ecd-f158-4fd1-b2b4-c35eb30f628f"], ["utilized Pytorch Lightning and Weights and Biases to create an automated pipeline that experimentally determined the best hyperparameters for a Vision Transformer used for image segmentation in April 2023.", "45946f27-d462-47ff-8656-b3d6d3aeff93"], ["produced internal tools for associating satellite images with related geoJSON data to produce files compatible with common mapping software, such as ArcGIS and QGIS.", "45946f27-d462-47ff-8656-b3d6d3aeff93"], ["utilized Pytorch Lightning and Weights and Biases to create an Automated Pipeline that experimentally determined the best Hyperparameters for a VisionTransformer used for image segmentation in April 2023", "e9162b08-f3cd-4d4d-9023-b50bbd23c0db"]]}, "4": {"subject": "Pytorch Lightning and Weights and Biases", "facts": [["were used by Fire Neural Network for automating pipeline processes that determined best Vision Transformer hyperparameters for image segmentation tasks.", "a4e6ed45-47f0-471c-a742-1048a87efbc8"]]}, "5": {"subject": "Internal tools", "facts": [["facilitated the linking of satellite images with corresponding geoJSON data, generating files compatible with popular mapping software programs like ArcGIS and QGIS by Fire Neural Network.", "a4e6ed45-47f0-471c-a742-1048a87efbc8"], ["were developed to associate satellite images with related geoJSON data, producing files compatible with mapping software such as ArcGIS and QGIS.", "83ef5d46-e64e-44d7-ad80-660a45950cf9"], ["produced tools for associating satellite images with related geoJSON data to produce files compatible with common mapping software.", "b4b4164b-9ad0-4a36-99b4-683b3b64b50e"]]}, "6": {"subject": "Researcher at the University of Florida's Interactive Visualization and 3D Graphics Lab (SurfLab)", "facts": [["trained and tested various segmentation models, including Video Vision Transformers and 3D UNet's from June to December 2022 in Gainesville, FL.", "a4e6ed45-47f0-471c-a742-1048a87efbc8"], ["trained and tested various segmentation models between June and December 2022, including Video Vision Transformers and 3D UNet's.", "45946f27-d462-47ff-8656-b3d6d3aeff93"]]}, "7": {"subject": "Lightning AI", "facts": [["was employed by this researcher on the University of Florida hypercomputer to train the segmentation model using a distributed system of GPUs.", "a4e6ed45-47f0-471c-a742-1048a87efbc8"], ["was utilized on the University of Florida hypercomputer for training the segmentation model on a distributed system of GPUs.", "83ef5d46-e64e-44d7-ad80-660a45950cf9"], ["was employed by the University of Florida's Interactive Visualization and 3D Graphics Lab (SurfLab) in Gainesville, FL for training segmentation models on a distributed system of GPUs from June to December 2022.", "6bb40060-a843-48b2-802f-d927e9d9eb60"], ["utilized on the University of Florida supercomputer for training and evaluating diverse segmentation models", "194765ff-d567-4844-b74f-9fe90d5b7997"], ["was utilized on the University of Florida hypercomputer to train the segmentation model on distributed GPUs.", "cea94a29-3746-4c9e-8c8d-79a0968cda55"], ["employed Lightning AI to train segmentation model on a distributed system of GPUs.", "b4b4164b-9ad0-4a36-99b4-683b3b64b50e"], ["enabled the researcher to train the segmentation model using a distributed system of GPUs at the University of Florida hypercomputer from June to December 2022.", "db3f5745-379f-4410-be68-e4eb772acdbc"], ["was utilized by Fire Neural Network on the University of Florida hypercomputer to train the segmentation model using a distributed system of GPUs.", "463f9ecd-f158-4fd1-b2b4-c35eb30f628f"]]}, "8": {"subject": "OpenAI API", "facts": [["provided educational tools for students via a web application", "a4e6ed45-47f0-471c-a742-1048a87efbc8"], ["provided educational tools to students via a web app.", "83ef5d46-e64e-44d7-ad80-660a45950cf9"], ["used with task-specific models like BART and BERT to provide educational tools to students through a web application", "1709d71c-f691-4430-aa64-952029f3449f"], ["integrated to develop educational resources via a web application", "194765ff-d567-4844-b74f-9fe90d5b7997"], ["integrated with various task-specific models like BART and BERT to develop a web app providing educational tools for students", "cea94a29-3746-4c9e-8c8d-79a0968cda55"], ["provided scholastic tools via a web app using various task-specific models like BART and BERT", "16cf2c16-2c86-488c-84f4-934364663f26"], ["provided scholastic tools to students via a web app, utilizing various task-specific models like BART and BERT", "315c7dac-9d96-49d1-8f0f-e43dead89e3a"], ["was used with various models like BART and BERT to create a web app providing scholastic tools for students", "db3f5745-379f-4410-be68-e4eb772acdbc"]]}, "9": {"subject": "BART", "facts": [["used in providing educational tools for students via a web application", "a4e6ed45-47f0-471c-a742-1048a87efbc8"], ["used for text summarization and customized text rephrasing for diverse audiences in the educational resources", "194765ff-d567-4844-b74f-9fe90d5b7997"], ["provided educational tools for students via a web application", "463f9ecd-f158-4fd1-b2b4-c35eb30f628f"]]}, "10": {"subject": "BERT", "facts": [["used in providing educational tools for students via a web application", "a4e6ed45-47f0-471c-a742-1048a87efbc8"], ["incorporated text summarization, automated text rephrasing for audiences of different technical levels", "83ef5d46-e64e-44d7-ad80-660a45950cf9"], ["used for Named Entity Recognition/definition in the educational resources", "194765ff-d567-4844-b74f-9fe90d5b7997"], ["provided educational tools for students via a web application", "463f9ecd-f158-4fd1-b2b4-c35eb30f628f"]]}, "11": {"subject": "Tensorflow", "facts": [["used to create a machine learning model for segmenting medical images effectively", "a4e6ed45-47f0-471c-a742-1048a87efbc8"], ["deployed to develop a machine learning model for segmenting medical imagery.", "83ef5d46-e64e-44d7-ad80-660a45950cf9"], ["utilized for creating a machine learning model for segmenting medical imagery", "6bb40060-a843-48b2-802f-d927e9d9eb60"], ["deployed to generate a machine learning model for segmenting medical imaging data", "194765ff-d567-4844-b74f-9fe90d5b7997"], ["utilized to create a machine learning model for segmenting medical imagery effectively", "cea94a29-3746-4c9e-8c8d-79a0968cda55"], ["employed along with PyTorch Lighting to produce a machine learning model for accurately segmenting medical imagery", "315c7dac-9d96-49d1-8f0f-e43dead89e3a"], ["and PyTorch Lighting were employed to generate a machine learning model that segmented medical imagery accurately", "db3f5745-379f-4410-be68-e4eb772acdbc"], ["created machine learning model for segmenting medical imagery", "463f9ecd-f158-4fd1-b2b4-c35eb30f628f"]]}, "12": {"subject": "PyTorch Lighting", "facts": [["used to create a machine learning model for segmenting medical images effectively", "a4e6ed45-47f0-471c-a742-1048a87efbc8"], ["replicated standard medical image segmentations compatible with prevalent medical visualization tools.", "83ef5d46-e64e-44d7-ad80-660a45950cf9"], ["employed for enhancing simulation speed in Texas Holdem Poker by over 741% using parallel and nested hashing structures", "6bb40060-a843-48b2-802f-d927e9d9eb60"], ["employed to enhance the developed machine learning model's performance", "cea94a29-3746-4c9e-8c8d-79a0968cda55"], ["created machine learning model for segmenting medical imagery", "463f9ecd-f158-4fd1-b2b4-c35eb30f628f"]]}, "13": {"subject": "Render-hosted API", "facts": [["developed using Stochastic simulations to estimate the likelihood of victory for each hand in Texas Holdem Poker", "a4e6ed45-47f0-471c-a742-1048a87efbc8"], ["utilized Stochastic simulations to estimate probabilities of winning for each hand in Texas Holdem Poker.", "83ef5d46-e64e-44d7-ad80-660a45950cf9"], ["engineered using stochastic simulations to estimate probabilities of winning in Texas Holdem poker", "194765ff-d567-4844-b74f-9fe90d5b7997"], ["developed that employed Stochastic simulations to estimate winning probabilities for each hand in Texas Holdem Poker", "cea94a29-3746-4c9e-8c8d-79a0968cda55"], ["uses Stochastic simulations to estimate winning probabilities for each hand in Texas Holdem Poker", "16cf2c16-2c86-488c-84f4-934364663f26"], ["produced using Stochastic simulations to approximate the odds of winning for each hand in a poker game", "315c7dac-9d96-49d1-8f0f-e43dead89e3a"], ["created a tool using Stochastic simulations to estimate the likelihood of winning for each hand in Texas Holdem Poker", "db3f5745-379f-4410-be68-e4eb772acdbc"], ["approximated odds of winning each hand in Texas Holdem Poker using Stochastic simulations", "463f9ecd-f158-4fd1-b2b4-c35eb30f628f"]]}, "14": {"subject": "Stochastic simulations", "facts": [["used to enhance simulation efficiency by over 741% through the utilization of parallel and nested hashing structures", "a4e6ed45-47f0-471c-a742-1048a87efbc8"], ["enhanced simulation efficiency by more than 741% through the utilization of parallel and nested hashing structures for estimating probabilities of winning in Texas Holdem poker", "194765ff-d567-4844-b74f-9fe90d5b7997"]]}, "15": {"subject": "common poker evaluation algorithms", "facts": [["incorporated for evaluating hands in Texas Holdem Poker", "a4e6ed45-47f0-471c-a742-1048a87efbc8"]]}, "16": {"subject": "implied pot odds", "facts": [["included in poker evaluation algorithms", "a4e6ed45-47f0-471c-a742-1048a87efbc8"], ["incorporated as a prevalent poker evaluation algorithm in the Render-hosted API", "194765ff-d567-4844-b74f-9fe90d5b7997"]]}, "17": {"subject": "implied odds dollars", "facts": [["included in poker evaluation algorithms", "a4e6ed45-47f0-471c-a742-1048a87efbc8"], ["incorporated as another prevalent poker evaluation algorithm in the Render-hosted API", "194765ff-d567-4844-b74f-9fe90d5b7997"]]}, "18": {"subject": "Dolphin", "facts": [["is pursuing his education at the University of Florida in Gainesville, FL", "83ef5d46-e64e-44d7-ad80-660a45950cf9"], ["is currently studying for a Bachelor of Science in Computer Engineering with a Minor in Biology", "83ef5d46-e64e-44d7-ad80-660a45950cf9"], ["has accomplished coursework in various subjects such as Software: Machine Learning Fundamentals, Signals and Systems, Data Structures and Algorithms, Computational Linear Algebra, Natural Language Processing, Operating Systems, Hardware: Digital Design, Digital Logic and Systems, Microprocessor Applications.", "83ef5d46-e64e-44d7-ad80-660a45950cf9"], ["had an internship opportunity at Ford Motor Company where he worked as a Machine Learning Engineer from March to August 2024", "83ef5d46-e64e-44d7-ad80-660a45950cf9"], ["further interned at Neurava in Baltimore, MD, serving as an Algorithm Engineering Intern during the period of May to August 2023", "83ef5d46-e64e-44d7-ad80-660a45950cf9"], ["devised internal tools capable of correlating satellite images with pertinent geoJSON data, generating files compatible with prevalent mapping software like ArcGIS and QGIS.", "1709d71c-f691-4430-aa64-952029f3449f"], ["endeavors culminated in enhancing model inference efficiency, elevating model throughput by 4.5 times.", "1709d71c-f691-4430-aa64-952029f3449f"], ["deployed Lightning AI on the university's hypercomputer to train the segmentation model on a distributed system of GPUs.", "1709d71c-f691-4430-aa64-952029f3449f"], ["also developed internal tools to associate satellite images with related geoJSON data, producing files compatible with popular mapping software like ArcGIS and QGIS.", "9afd3320-3c96-4587-941a-2b170b9b8456"], ["worked on a project called Educatus, which is a NextJS Web app providing study/research utilities for students.", "9afd3320-3c96-4587-941a-2b170b9b8456"], ["utilized the OpenAI API along with BART and BERT models to provide scholastic tools for students via a web application in October 2022", "9afd3320-3c96-4587-941a-2b170b9b8456"], ["employed TensorFlow and PyTorch Lighting to create a machine learning model for segmenting medical imagery in January 2022", "9afd3320-3c96-4587-941a-2b170b9b8456"], ["developed a Render-hosted API for a data- based tooling application related to Texas Holdem Poker in June 2023", "9afd3320-3c96-4587-941a-2b170b9b8456"], ["served as the technical lead of the AI Research and Development Club in an extracurricular capacity", "9afd3320-3c96-4587-941a-2b170b9b8456"], ["granted a Bachelor of Science in Computer Engineering and a Minor in Biology by University of Florida from August 2020 to December 2024", "16cf2c16-2c86-488c-84f4-934364663f26"], ["studied Machine Learning Fundamentals, Signals and Systems, Data Structures and Algorithms, Computational Linear Algebra, Natural Language Processing, Operating Systems, Digital Design, Digital Logic and Systems, Microprocessor Applications at University of Florida from August 2020 to December 2024", "16cf2c16-2c86-488c-84f4-934364663f26"], ["employed as a Machine Learning Engineer by Ford Motor Company from March 2024 to August 2024", "16cf2c16-2c86-488c-84f4-934364663f26"], ["developed models for car defect forecasting using global analytics on plant efficiency and vehicle warranty usage, focusing on metrics of interest during internship at Ford", "16cf2c16-2c86-488c-84f4-934364663f26"], ["discovered incorrect metrics through experimentation and advocated for their replacement successfully at Ford", "16cf2c16-2c86-488c-84f4-934364663f26"], ["contributed significantly in discovering more accurate metrics for determining warranty expenditure and vehicle defect rates at Ford", "16cf2c16-2c86-488c-84f4-934364663f26"], ["employed as an Algorithm Engineering Intern by Neurava from May 2023 to August 2023", "16cf2c16-2c86-488c-84f4-934364663f26"], ["enhanced feature information capture by 358% while working on automated calculation of energy-entropy ratio for various wavelets at Neurava", "16cf2c16-2c86-488c-84f4-934364663f26"], ["analyzed biological signals using Continuous Transformers, Decision Trees, and Wavelet Transforms at Neurava", "16cf2c16-2c86-488c-84f4-934364663f26"], ["developed a feature extraction and model validation pipeline to automate the discovery of new and efficient epilepsy detection algorithms at Neurava", "16cf2c16-2c86-488c-84f4-934364663f26"], ["obtained a Bachelor of Science in Computer Engineering with a Minor in Biology from the University of Florida", "b4b4164b-9ad0-4a36-99b4-683b3b64b50e"], ["pursued his degree from August 2020 to December 2024", "b4b4164b-9ad0-4a36-99b4-683b3b64b50e"], ["interned as a Machine Learning Engineer at Ford Motor Company from March to August 2024", "b4b4164b-9ad0-4a36-99b4-683b3b64b50e"], ["worked as an Algorithm Engineering Intern at Neurava from May to August 2023", "b4b4164b-9ad0-4a36-99b4-683b3b64b50e"], ["contributed to discovering new metrics for determining warranty expenditure and vehicle defect rates during his internship at Ford Motor Company", "b4b4164b-9ad0-4a36-99b4-683b3b64b50e"], ["improved feature information capture by 358% through the automated calculation of energy-entropy ratio for various wavelets while at Neurava", "b4b4164b-9ad0-4a36-99b4-683b3b64b50e"], ["analyzed biological signals using Continuous Transformers, Decision Trees, and Wavelet Transforms as a Machine Learning Research Intern", "b4b4164b-9ad0-4a36-99b4-683b3b64b50e"], ["applied Pytorch Lightning and Weights and Biases for automating a pipeline that experimentally identified the optimal hyperparameters for a Vision Transformer in image segmentation tasks.", "db3f5745-379f-4410-be68-e4eb772acdbc"], ["developed proprietary tools to link satellite images with corresponding geoJSON data, producing files suitable for widely-used mapping software like ArcGIS and QGIS.", "db3f5745-379f-4410-be68-e4eb772acdbc"], ["enhanced model inference efficiency by 4.5 times through optimization.", "db3f5745-379f-4410-be68-e4eb772acdbc"], ["studied at the University of Florida in Gainesville, FL", "45946f27-d462-47ff-8656-b3d6d3aeff93"], ["pursued a Bachelor of Science in Computer Engineering with a Minor in Biology", "45946f27-d462-47ff-8656-b3d6d3aeff93"], ["expected to graduate in December 2024", "45946f27-d462-47ff-8656-b3d6d3aeff93"], ["completed coursework in Software: Machine Learning Fundamentals, Signals and Systems, Data Structures and Algorithms, Computational Linear Algebra, Natural Language Processing, Operating Systems, Hardware: Digital Design, Digital Logic and Systems, Microprocessor Applications.", "45946f27-d462-47ff-8656-b3d6d3aeff93"], ["interned as a Machine Learning Engineer at Ford Motor Company from March to August 2024", "45946f27-d462-47ff-8656-b3d6d3aeff93"], ["analyzed global analytics on plant efficiency and vehicle warranty usage, deriving models for car defect forecasting and determining metrics of focus.", "45946f27-d462-47ff-8656-b3d6d3aeff93"], ["discovered improperly calculated metrics by experimentally determining their lack of utility and successfully endorsed their replacement.", "45946f27-d462-47ff-8656-b3d6d3aeff93"], ["helped discover new metrics that more accurately determined warranty expenditure and vehicle defect rates.", "45946f27-d462-47ff-8656-b3d6d3aeff93"], ["interned as an Algorithm Engineering Intern at Neurava in May-August 2023", "45946f27-d462-47ff-8656-b3d6d3aeff93"], ["improved feature information capture by 358% through the automated calculation of energy-entropy ratio for various wavelets.", "45946f27-d462-47ff-8656-b3d6d3aeff93"], ["analyzed biological signals using Continuous Transformers, Decision Trees, and Wavelet Transforms.", "45946f27-d462-47ff-8656-b3d6d3aeff93"], ["automated the discovery of new and efficient epilepsy detection algorithms by developing a feature extraction and model validation pipeline.", "45946f27-d462-47ff-8656-b3d6d3aeff93"], ["is a Classifier with Tree-Structured Classifiers.", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"], ["Constructs Multiple Decision Trees on Randomly Selected Sub-Samples for Aggregation of Results.", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"], ["Considers Random Subset of Features to Increase Model Diversity.", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"], ["Involves Voting Mechanism for Classification Tasks.", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"], ["", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"], ["", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"], ["is a helpful AI assistant", "947abeb5-2c90-4900-89b0-9519f6538542"], ["provides accurate and concise answers to user queries", "947abeb5-2c90-4900-89b0-9519f6538542"], ["is available 24/7 for assistance", "947abeb5-2c90-4900-89b0-9519f6538542"]]}, "19": {"subject": "Fire Neural Network project", "facts": [["utilized Pytorch Lightning and Weights and Biases for automating hyperparameter optimization in image segmentation with Vision Transformer.", "83ef5d46-e64e-44d7-ad80-660a45950cf9"], ["utilized Pytorch Lightning and Weights and Biases to experimentally determine the best hyperparameters for a Vision Transformer used for image segmentation.", "b4b4164b-9ad0-4a36-99b4-683b3b64b50e"]]}, "20": {"subject": "Model inference", "facts": [["was optimized, resulting in a 4.5x increase in model throughput.", "83ef5d46-e64e-44d7-ad80-660a45950cf9"], ["optimized model inference by increasing model throughput 4.5x.", "b4b4164b-9ad0-4a36-99b4-683b3b64b50e"]]}, "21": {"subject": "Researcher", "facts": [["worked at the University of Florida Interactive Visualization and 3D Graphics Lab (SurfLab) from June to December 2022.", "83ef5d46-e64e-44d7-ad80-660a45950cf9"], ["worked from June to December 2022 at the University of Florida's Interactive Visualization and 3D Graphics Lab (SurfLab) in Gainesville, FL.", "16cf2c16-2c86-488c-84f4-934364663f26"], ["trained and tested various segmentation models, such as Video Vision Transformers and 3D UNet’ s.", "b4b4164b-9ad0-4a36-99b4-683b3b64b50e"]]}, "22": {"subject": "Various segmentation models", "facts": [["were trained and tested, including Video Vision Transformers and 3D UNet's.", "83ef5d46-e64e-44d7-ad80-660a45950cf9"]]}, "23": {"subject": "Educatus project", "facts": [["involved developing a NextJS web app to provide study and research utilities to students.", "83ef5d46-e64e-44d7-ad80-660a45950cf9"], ["involved creating a NextJS Web app for providing study/research utilities to students.", "b4b4164b-9ad0-4a36-99b4-683b3b64b50e"]]}, "24": {"subject": "", "facts": [["", "83ef5d46-e64e-44d7-ad80-660a45950cf9"], ["", "83ef5d46-e64e-44d7-ad80-660a45950cf9"], ["", "83ef5d46-e64e-44d7-ad80-660a45950cf9"], ["", "83ef5d46-e64e-44d7-ad80-660a45950cf9"], ["", "83ef5d46-e64e-44d7-ad80-660a45950cf9"], ["", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"], ["", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"], ["", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"], ["", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"], ["", "947abeb5-2c90-4900-89b0-9519f6538542"], ["", "947abeb5-2c90-4900-89b0-9519f6538542"]]}, "25": {"subject": "Educatus", "facts": [["is a NextJS web app created for providing study/research utilities to students.", "6bb40060-a843-48b2-802f-d927e9d9eb60"], ["an Octopus-inspired AI platform developed for complex data fusion tasks", "194765ff-d567-4844-b74f-9fe90d5b7997"]]}, "26": {"subject": "OpenAI", "facts": [["integrated various task-specific models like BART and BERT to develop an educational web app", "6bb40060-a843-48b2-802f-d927e9d9eb60"]]}, "27": {"subject": "a researcher at the University of Florida's Interactive Visualization and 3D Graphics Lab (SurfLab)", "facts": [["trained and evaluated various segmentation models, encompassing Video Vision Transformers and 3D UNet' s from June to December 2022.", "1709d71c-f691-4430-aa64-952029f3449f"], ["conceived Educatus - a NextJS Web app providing study/research utilities for students.", "1709d71c-f691-4430-aa64-952029f3449f"]]}, "28": {"subject": "TensorFlow", "facts": [["and PyTorch Lighting were employed to create a machine learning model for segmenting medical images", "1709d71c-f691-4430-aa64-952029f3449f"], ["used to develop a machine learning model for segmenting medical images", "b4b4164b-9ad0-4a36-99b4-683b3b64b50e"]]}, "29": {"subject": "medical image segmentations", "facts": [["were accurately reproduced, compatible with common medical visualization tools", "1709d71c-f691-4430-aa64-952029f3449f"], ["successfully replicated using machine learning models trained on established segmentations, compatible with prevalent medical visualization tools", "194765ff-d567-4844-b74f-9fe90d5b7997"], ["reproduced using the developed approach, compatible with common medical visualization tools", "cea94a29-3746-4c9e-8c8d-79a0968cda55"], ["are compatible with prevalent medical visualization tools", "16cf2c16-2c86-488c-84f4-934364663f26"]]}, "30": {"subject": "Texas Holdem Poker", "facts": [["a Render-hosted API developed that used Stochastic simulations to estimate the chances of winning for each hand", "1709d71c-f691-4430-aa64-952029f3449f"], ["simulation speed enhanced by over 741% through implementing parallel and nested hashing structures", "cea94a29-3746-4c9e-8c8d-79a0968cda55"]]}, "31": {"subject": "simulation speed", "facts": [["improved by over 741% using parallel and nested hashing structures", "1709d71c-f691-4430-aa64-952029f3449f"], ["improved by over 741% using parallel and nested hashing structures within the poker odds approximation API", "315c7dac-9d96-49d1-8f0f-e43dead89e3a"]]}, "32": {"subject": "poker evaluation algorithms", "facts": [["implemented, such as implied pot odds and implied odds dollars", "1709d71c-f691-4430-aa64-952029f3449f"]]}, "33": {"subject": "University of Florida's Interactive Visualization and 3D Graphics Lab (SurfLab)", "facts": [["trained and evaluated diverse segmentation models, including Video Vision Transformers and 3D UNet' variants", "194765ff-d567-4844-b74f-9fe90d5b7997"]]}, "34": {"subject": "PyTorch Lightning", "facts": [["used as an alternative framework to Tensorflow for generating the machine learning model for segmenting medical imaging data", "194765ff-d567-4844-b74f-9fe90d5b7997"], ["used to enhance simulation speed in Texas Holdem Poker by over 741% through parallel and nested hashing structures", "b4b4164b-9ad0-4a36-99b4-683b3b64b50e"]]}, "35": {"subject": "Researchers at the University of Florida's Interactive Visualization and 3D Graphics Lab (SurfLab)", "facts": [["trained and tested segmentation models including Video Vision Transformers and 3D UNet's from June to December 2022 in Gainesville, FL.", "cea94a29-3746-4c9e-8c8d-79a0968cda55"]]}, "36": {"subject": "web app", "facts": [["included text summarization, automated text rephrasing, automatic quiz generation, Named Entity Recognition/definition, and more", "cea94a29-3746-4c9e-8c8d-79a0968cda55"]]}, "37": {"subject": "A researcher", "facts": [["From June to December 2022, a researcher at the University of Florida's Interactive Visualization and 3D Graphics Lab (SurfLab) in Gainesville, FL trained and tested various segmentation models, including Video Vision Transformers and 3D UNet's.", "9afd3320-3c96-4587-941a-2b170b9b8456"]]}, "38": {"subject": "The researcher", "facts": [["employed Lightning AI on the University of Florida hypercomputer to train the segmentation model on a distributed system of GPUs.", "9afd3320-3c96-4587-941a-2b170b9b8456"]]}, "39": {"subject": "They", "facts": [["developed tools associating satellite images with geoJSON data, creating ArcGIS and QGIS-compatible files.", "16cf2c16-2c86-488c-84f4-934364663f26"], ["trained and tested various segmentation models, including Video Vision Transformers and 3D UNet's.", "16cf2c16-2c86-488c-84f4-934364663f26"], ["optimized model inference, increasing model throughput by 4.5x", "e9162b08-f3cd-4d4d-9023-b50bbd23c0db"]]}, "40": {"subject": "SurfLab", "facts": [["deployed Lightning AI on the University of Florida hypercomputer for distributed GPU training of the segmentation model.", "16cf2c16-2c86-488c-84f4-934364663f26"]]}, "41": {"subject": "Tensorflow and PyTorch Lighting", "facts": [["developed a machine learning model for segmenting medical imagery", "16cf2c16-2c86-488c-84f4-934364663f26"], ["created a machine learning model that analyzes medical imagery", "e9162b08-f3cd-4d4d-9023-b50bbd23c0db"]]}, "42": {"subject": "Texas Holdem AI Improvements", "facts": [["enhanced simulation speed by over 741% through parallel and nested hashing structures' implementation", "16cf2c16-2c86-488c-84f4-934364663f26"]]}, "43": {"subject": "SurfLab AI", "facts": [["trained and tested various segmentation models, including Video Vision Transformers and 3D UNet’st from June to December 2022 at the University of Florida's SurfLab in Gainesville, FL.", "315c7dac-9d96-49d1-8f0f-e43dead89e3a"], ["employed Lightning AI on the university's hypercomputer to train the segmentation model on a distributed system of GPUs.", "315c7dac-9d96-49d1-8f0f-e43dead89e3a"]]}, "44": {"subject": "text summarization", "facts": [["included in the functionality of the web app", "315c7dac-9d96-49d1-8f0f-e43dead89e3a"]]}, "45": {"subject": "automated text rephrasing", "facts": [["aimed for different audience levels within the web app", "315c7dac-9d96-49d1-8f0f-e43dead89e3a"]]}, "46": {"subject": "automatic quiz generation", "facts": [["offered by the web app to assess students' knowledge", "315c7dac-9d96-49d1-8f0f-e43dead89e3a"]]}, "47": {"subject": "Named Entity Recognition", "facts": [["performed in the web app to identify and classify entities mentioned in text", "315c7dac-9d96-49d1-8f0f-e43dead89e3a"]]}, "48": {"subject": "Medmodeler", "facts": [["leveraged PyTorch Vision Transformer for segmenting CAT Scans", "315c7dac-9d96-49d1-8f0f-e43dead89e3a"]]}, "49": {"subject": "Rollsolid", "facts": [["developed data-base tooling specifically tailored for Texas Holdem Poker", "315c7dac-9d96-49d1-8f0f-e43dead89e3a"]]}, "50": {"subject": "Common poker evaluation algorithms", "facts": [["implemented for calculating implied pot odds and implied odds dollars in the Texas Holdem Poker app", "315c7dac-9d96-49d1-8f0f-e43dead89e3a"]]}, "51": {"subject": "Dolphin AI Assistant", "facts": [["provided academic tools for students via a web app", "b4b4164b-9ad0-4a36-99b4-683b3b64b50e"]]}, "52": {"subject": "researcher from the University of Florida's Interactive Visualization and 3D Graphics Lab (SurfLab)", "facts": [["trained and evaluated various segmentation models, including Video Vision Transformers and 3D UNet' variants.", "db3f5745-379f-4410-be68-e4eb772acdbc"]]}, "53": {"subject": "The model", "facts": [["was designed to reproduce standard medical image segmentations which are compatible with common medical visualization tools", "db3f5745-379f-4410-be68-e4eb772acdbc"]]}, "54": {"subject": "Simulation speed", "facts": [["was improved by over 741% using parallel and nested hashing structures", "db3f5745-379f-4410-be68-e4eb772acdbc"]]}, "55": {"subject": "Poker evaluation algorithms", "facts": [["like implied pot odds and implied odds dollars were implemented", "db3f5745-379f-4410-be68-e4eb772acdbc"]]}, "56": {"subject": "the team at Fire Neural Network", "facts": [["optimized model inference between June and December 2022, resulting in a 4.5x increase in model throughput throughout their research efforts.", "463f9ecd-f158-4fd1-b2b4-c35eb30f628f"]]}, "57": {"subject": "a researcher at the University of Florida's Interactive Visualization and 3D Graphics Lab (SurfLab) in Gainesville, FL", "facts": [["trained and tested multiple segmentation models, including Video Vision Transformers and 3D UNet's.", "463f9ecd-f158-4fd1-b2b4-c35eb30f628f"]]}, "58": {"subject": "the team", "facts": [["collaborated on a project named Educatus, developing a NextJS web app designed for providing study and research utilities to students.", "463f9ecd-f158-4fd1-b2b4-c35eb30f628f"]]}, "59": {"subject": "Implied pot odds", "facts": [["implemented in poker evaluation algorithms", "463f9ecd-f158-4fd1-b2b4-c35eb30f628f"]]}, "60": {"subject": "Implied odds dollars", "facts": [["implemented in poker evaluation algorithms", "463f9ecd-f158-4fd1-b2b4-c35eb30f628f"]]}, "61": {"subject": "University of Florida", "facts": [["employed Lightning AI on the hypercomputer to train the segmentation model on a distributed system of GPUs.", "45946f27-d462-47ff-8656-b3d6d3aeff93"]]}, "62": {"subject": "OpenAI API, task-specific models", "facts": [["Provided scholastic tools for students through a web app.", "45946f27-d462-47ff-8656-b3d6d3aeff93"]]}, "63": {"subject": "Text summarization, automated text rephrasing, automatic quiz generation, Named Entity Recognition", "facts": [["Included functionality like text summarizing and automated text rephrasing in the web app.", "45946f27-d462-47ff-8656-b3d6d3aeff93"]]}, "64": {"subject": "Tensorflow, PyTorch Lighting, machine learning model", "facts": [["Produced a machine learning model for segmenting medical imagery using Tensorflow and PyTorch Lighting.", "45946f27-d462-47ff-8656-b3d6d3aeff93"]]}, "65": {"subject": "Standard medical image segmentations, medical visualization tools", "facts": [["Reproduced accurate medical image segmentations compatible with medical visualization tools.", "45946f27-d462-47ff-8656-b3d6d3aeff93"]]}, "66": {"subject": "Render-Hosted API, Stochastic simulations, Texas Holdem Poker", "facts": [["Produced an API using Stochastic simulations to approximate Texas Holdem Poker winning odds.", "45946f27-d462-47ff-8656-b3d6d3aeff93"]]}, "67": {"subject": "Simulation speed, parallel and nested hashing structures", "facts": [["Improved simulation speed using parallel and nested hashing structures.", "45946f27-d462-47ff-8656-b3d6d3aeff93"]]}, "68": {"subject": "Poker evaluation algorithms, implied pot odds, implied odds dollars", "facts": [["Implemented common poker evaluation algorithms like implied pot odds and implied odds dollars.", "45946f27-d462-47ff-8656-b3d6d3aeff93"]]}, "69": {"subject": "The team at Fire Neural Network", "facts": [["produced internal tools for associating satellite images with related geoJSON data, creating files compatible with common mapping software such as ArcGIS and QGIS", "e9162b08-f3cd-4d4d-9023-b50bbd23c0db"]]}, "70": {"subject": "A researcher at the University of Florida's InteractiveVisualization and 3D Graphics Lab (SurfLab) in Gainesville, FL", "facts": [["trained and tested various segmentation models, including VideoVisionTransformers and 3D UNet’s from June to December 2022", "e9162b08-f3cd-4d4d-9023-b50bbd23c0db"]]}, "71": {"subject": "They employed Lightning AI on the University of Florida hypercomputer", "facts": [["to train the segmentation model on a distributed system of GPUs", "e9162b08-f3cd-4d4d-9023-b50bbd23c0db"]]}, "72": {"subject": "Leveraged OpenAI API", "facts": [["developed an educational web app with features including text summarization, automated text rephrasing for diverse audiences, automatic quiz generation, and Named Entity Recognition/definition capabilities", "e9162b08-f3cd-4d4d-9023-b50bbd23c0db"]]}, "73": {"subject": "Generated replicas of standard medical image segmentations", "facts": [["compatible with prevalent medical visualization tools", "e9162b08-f3cd-4d4d-9023-b50bbd23c0db"]]}, "74": {"subject": "Engineered Render-hosted API", "facts": [["utilizing Stochastic simulations to estimate the chances of victory for each hand in Texas Holdem Poker", "e9162b08-f3cd-4d4d-9023-b50bbd23c0db"]]}, "75": {"subject": "Enhanced simulation speed by over 741%", "facts": [["through parallel and nested hashing structures implementation", "e9162b08-f3cd-4d4d-9023-b50bbd23c0db"]]}, "76": {"subject": "Incorporated common poker evaluation algorithms", "facts": [["such as implied pot odds and implied odds dollars into the system", "e9162b08-f3cd-4d4d-9023-b50bbd23c0db"]]}, "77": {"subject": "Cong Zhang, Wenxing Guo, and Hongsheng Dai", "facts": [["conducted a study on detecting Mild Cognitive Impairment using acoustic features in spontaneous speech", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "78": {"subject": "Three experiments", "facts": [["were conducted comparing five machine-learning methods: Random Forests, Sparse Logistic Regression, k-Nearest Neighbors, Sparse Support Vector Machine, and Decision Tree.", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "79": {"subject": "Experiment 1", "facts": [["used the entire dataset to train a language-agnostic model", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"], ["trained models with all data, including English and Chinese, tested them on an in-sample test set", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "80": {"subject": "Dr. Cong Zhang", "facts": [["led the research team in implementing a language detection step for Experiment 2", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "81": {"subject": "Experiment 3", "facts": [["further enhanced the language-agnostic model from Experiment 1 by evaluating the robustness of the models using out-of-sample test data.", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"], ["enhanced the language-agnostic model from Experiment 1, tested its robustness using out-of-sample test data", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"], ["Evaluated the predictive performance of various machine learning methods", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "82": {"subject": "Results", "facts": [["consistently favored models capable of handling high-dimensional data, such as Random Forest and Sparse Logistic Regression, in classifying speech from MCI and controls.", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "83": {"subject": "Mild cognitive impairment (MCI)", "facts": [["is the early stage of dementia", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "84": {"subject": "Individuals", "facts": [["experiencing MCI may report subjective cognitive difficulties, for instance, forgetting recent events.", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "85": {"subject": "MCI", "facts": [["often leads to full--blown dementia.", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "86": {"subject": "Early intervention", "facts": [["is essential in the case of MCI due to its neurodegenerative nature.", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "87": {"subject": "Accurate diagnosis", "facts": [["of MCI can prove challenging because of the subtle presentation of early-stage symptoms.", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "88": {"subject": "Automatic cognitive assessment", "facts": [["serves as a valuable tool for diagnosing MCI, providing easy accessibility for patients and convenient reference for healthcare professionals.", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "89": {"subject": "[1]", "facts": [["explores various speech-related factors that distinguish MCI speakers from typical speakers, including fluency, intonation, and speech rate.", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "90": {"subject": "Dolphin Classification", "facts": [["has received less attention compared to MCI", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "91": {"subject": "classification models", "facts": [["trained for MCI and Alzheimer's Disease using acoustic features, including Automatic Speech Recognition outputs and linguistic features.", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "92": {"subject": "acoustic and linguistic features", "facts": [["combination outperformed unimodal input in MCI classification", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "93": {"subject": "manual segmentation", "facts": [["had higher accuracy than automatic segmentation in extracting acoustic features for MCI classification", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "94": {"subject": "temporal and spectral features", "facts": [["used to build logistic regression models to predict MCI", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "95": {"subject": "MCI classification accuracy", "facts": [["assessed through a 3-fold cross-validation yielded a result of 0.61.", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "96": {"subject": "TAUKADIAL Challenge", "facts": [["six tested eGeMAPs features (88 features), a self-supervised feature learning approach, wav2vec (512 features), and their combination for MCI classification", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "97": {"subject": "Adriaan van Wijngaarden", "facts": [["employed Dijkstra as the first computer programmer in the Netherlands at the Mathematical Centre in Amsterdam (1952-1962)", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "98": {"subject": "Dijkstra", "facts": [["formulated the shortest path problem in 1956", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"], ["solved the shortest path problem in 1956", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"], ["formulated the shortest path problem in 1956", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"], ["was employed by Adriaan van Wijngaarden as the first computer programmer in the Netherlands at the Mathematical Centre in Amsterdam (1952-1962)", "947abeb5-2c90-4900-89b0-9519f6538542"]]}, "99": {"subject": "John", "facts": [["is reknowned for his Computer Science contributions", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "100": {"subject": "English files (62 speakers)", "facts": [["were identified in the text after Mandarin ones.", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "101": {"subject": "Raw audio files", "facts": [["had their acoustic features extracted with the openSMILE Toolkit.", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "102": {"subject": "emobase and eGeMAPSv02 feature sets", "facts": [["were extracted using the Python package opensmile2 in Python 3.9.", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"], ["offer comprehensive coverage of consonants, vowels, voice qualities, and prosodic aspects pertinent to MCI speech.", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "103": {"subject": "no additional data processing", "facts": [["occurred to maintain automation in the process.", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "104": {"subject": "Regularization techniques", "facts": [["were utilized for feature selection, attempting to diminish overfitting while enhancing model generalizability through adjusting feature weights.", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "105": {"subject": "Elastic Net regularization", "facts": [["is merged with logistic regression", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "106": {"subject": "Logistic Regression", "facts": [["incorporates L1 regularization (Lasso) and L2 regularization (Ridge)", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "107": {"subject": "Objective function of Elastic Net in logistic regression", "facts": [["reads: -\\sum(y_i*log(p_i) + (1-y_i)*log(1-p_i)) + \\lambda_1*||\\beta||_1+\\lambda_2*||\\beta||_2^2", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "108": {"subject": "\\lambda_1 and \\lambda_2", "facts": [["are parameters managing the intensity of L1 and L2 regularization penalties", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "109": {"subject": "||\\beta||_1", "facts": [["is the L1 norm (sum of absolute values)", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "110": {"subject": "||\\beta||_2^2", "facts": [["is the squared L2 norm (sum of squared parameters)", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "111": {"subject": "\\beta", "facts": [["is the coefficient vector of the model", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "112": {"subject": "Adjusting \\lambda_1 and \\lambda_2", "facts": [["can balance the model's fit and complexity, resulting in enhanced generalization performance", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "113": {"subject": "Elastic Net", "facts": [["has its primary benefit lies in its capacity to handle high-dimensional data and correlated features while selectively preserving pertinent features and compressing others to zero", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "114": {"subject": "Sparse Support Vector Machine", "facts": [["verifies induction sparsity", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "115": {"subject": "Traditional Support Vector Machine Algorithm", "facts": [["extended for sparsity", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "116": {"subject": "Elastic Net Penalty", "facts": [["applied in SSVM", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"], ["still applied in SSVM: λ1 controls L1 regularization, λ2 controls L2 regularization", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "117": {"subject": "Objective Function of SSVM", "facts": [["defined as hinge loss", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "118": {"subject": "Hinge Loss Function", "facts": [["used in SSVM: hingeLoss(1) = max(0, 1 - t)", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "119": {"subject": "Positive values", "facts": [["signify misclassification", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "120": {"subject": "SSVM aims to find a hyperplane that separates classes with fewer features.", "facts": [["dimensionality reduced, computational efficiency improved.", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "121": {"subject": "k-Nearest Neighbors Classification Method", "facts": [["is non-parametric and instance-based learning algorithm", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "122": {"subject": "Unseen data point classified by majority class among its k nearest neighbors in feature space.", "facts": [["", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "123": {"subject": "Choice of k influences model's performance.", "facts": [["crucial hyperparameter to optimize for best results.", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "124": {"subject": "Decision Tree", "facts": [["is a method used for classification and regression tasks.", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "125": {"subject": "Decision Trees", "facts": [["create structure by dataset splitting subsets based on feature with most significant information gain or decrease impurity.", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "126": {"subject": "Each internal node of tree", "facts": [["represents decision based on feature, while each leaf node corresponds class label or regression value.", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "127": {"subject": "Decision trees", "facts": [["are interpretable and easy to visualize, making them useful for understanding the decision-making process.", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "128": {"subject": "metrics", "facts": [["provide a comprehensive assessment of the performance of MCI classification", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "129": {"subject": "Experiment 2", "facts": [["included a language detection step, the models were trained separately", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "130": {"subject": "all models", "facts": [["trained and tested in R", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "131": {"subject": "relevant R packages", "facts": [["used for comparison: Random Forests (ranger), Sparse Logistic Regression (glmnet), k-Nearest Neighbors (class), Sparse Support Vector Machine (sparseSVM), Decision Tree (part)", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "132": {"subject": "Assistant", "facts": [["", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "133": {"subject": "RF", "facts": [["excels among the methods assessed in the Chinese dataset", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "134": {"subject": "SLR", "facts": [["excels among the methods assessed in the Chinese dataset", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "135": {"subject": "SSVM", "facts": [["excels among the methods assessed in the Chinese dataset", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "136": {"subject": "KNN", "facts": [["demonstrates the weakest performance compared to all other methods used in the Chinese dataset", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "137": {"subject": "Dataset", "facts": [["Divided into training and test sets using train-test ratios of 1:1, 2:1, 3:1, 4:1, and 5:1", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "138": {"subject": "Train-Test Split", "facts": [["Conducted 100 times for each", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "139": {"subject": "RF (Random Forest)", "facts": [["Consistently outperformed other methods in terms of F1 Score, with scores ranging from 0.84 to 0.88.", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "140": {"subject": "DT (Decision Tree)", "facts": [["Had F1 scores ranging from 0.73 to 0.78.", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "141": {"subject": "SLR (Support Vector Machines - Linear Regression)", "facts": [["Had F1 scores ranging from 0.78 to 0.81.", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "142": {"subject": "KNN (K-Nearest Neighbors)", "facts": [["Consistently showed lower F1 scores compared to other methods, with scores ranging from 0.66 to 0.67.", "8f4b6836-bc23-4ec0-b2c5-630db6580eb9"]]}, "143": {"subject": "Alice", "facts": [["", "947abeb5-2c90-4900-89b0-9519f6538542"], ["", "947abeb5-2c90-4900-89b0-9519f6538542"]]}, "144": {"subject": "Bob", "facts": [["", "947abeb5-2c90-4900-89b0-9519f6538542"], ["", "947abeb5-2c90-4900-89b0-9519f6538542"]]}, "145": {"subject": "The Associated Press", "facts": [["is an independent global news organization that offers fast, accurate, unbiased news in all formats.", "947abeb5-2c90-4900-89b0-9519f6538542"], ["was founded in 1846 by a group of journalists who sought to create an independent newswire service.", "947abeb5-2c90-4900-89b0-9519f6538542"], ["offers a range of innovative technology solutions and services that help news organizations stay competitive and relevant in today's digital age.", "947abeb5-2c90-4900-89b0-9519f6538542"], ["is an independent global news organization dedicated to factual reporting since 1846, known for being the most trusted source of fast, accurate, unbiased news across all formats.", "947abeb5-2c90-4900-89b0-9519f6538542"], ["was founded in 1846", "8b662520-f803-4631-a009-d6d33e880828"], ["remains the trusted source of news that is delivered quickly and accurately without bias in various formats", "8b662520-f803-4631-a009-d6d33e880828"]]}, "146": {"subject": "AP", "facts": [["is known for providing fast, accurate, unbiased news in all formats.", "947abeb5-2c90-4900-89b0-9519f6538542"], ["reaches millions of people around the globe who rely on accurate, timely news to stay informed about local and global events.", "947abeb5-2c90-4900-89b0-9519f6538542"]]}, "147": {"subject": "Google", "facts": [["has unlawfully leveraged its supremacy to suppress competition and impede innovation", "947abeb5-2c90-4900-89b0-9519f6538542"], ["will face an elongated appeals process, postponing any immediate consequences for both consumers and advertisers as a result of the ruling against them.", "947abeb5-2c90-4900-89b0-9519f6538542"], ["dominates search engines unlawfully", "947abeb5-2c90-4900-89b0-9519f6538542"], ["dismissed allegations of manipulative behavior.", "947abeb5-2c90-4900-89b0-9519f6538542"], ["lost in its antitrust trial regarding search", "947abeb5-2c90-4900-89b0-9519f6538542"], ["may successfully defend against Mehta's ban on default search agreements", "947abeb5-2c90-4900-89b0-9519f6538542"], ["remains vulnerable to class-action lawsuits due to monopolistic pricing practices exposed by the judge's findings", "947abeb5-2c90-4900-89b0-9519f6538542"], ["paid Apple $20 billion", "947abeb5-2c90-4900-89b0-9519f6538542"], ["faces federal trial in Virginia due to Justice Department's allegations of illegal monopoly in advertising technology.", "947abeb5-2c90-4900-89b0-9519f6538542"]]}, "148": {"subject": "Judge Amit Mehta", "facts": [["rules on antitrust lawsuit against Justice Department", "947abeb5-2c90-4900-89b0-9519f6538542"], ["ruled on Google spending billions on making its search engine the default option.", "947abeb5-2c90-4900-89b0-9519f6538542"]]}, "149": {"subject": "antitrust battle", "facts": [["climaxes in 25-year-older showdown", "947abeb5-2c90-4900-89b0-9519f6538542"]]}, "150": {"subject": "Justice Department", "facts": [["faces antitrust lawsuit ruling by Judge Amit Mehta", "947abeb5-2c90-4900-89b0-9519f6538542"], ["filed a lawsuit against Google nearly four years ago under President Donald Trump's administration.", "947abeb5-2c90-4900-89b0-9519f6538542"]]}, "151": {"subject": "Microsoft, Apple, and Google executives", "facts": [["testify in court", "947abeb5-2c90-4900-89b0-9519f6538542"]]}, "152": {"subject": "Merrick Garland", "facts": [["announced a historical victory against Google.", "947abeb5-2c90-4900-89b0-9519f6538542"], ["emphasized that no company is above the law.", "947abeb5-2c90-4900-89b0-9519f6538542"]]}, "153": {"subject": "Justice Department lawyers", "facts": [["argued that Google's lax approach harms consumers.", "947abeb5-2c90-4900-89b0-9519f6538542"]]}, "154": {"subject": "The remedy entails", "facts": [["significantly impact the company based on what", "947abeb5-2c90-4900-89b0-9519f6538542"]]}, "155": {"subject": "A prolonged appeals process", "facts": [["will delay effects for consumers and advertisers alike", "947abeb5-2c90-4900-89b0-9519f6538542"]]}, "156": {"subject": "The appeals process", "facts": [["could extend up to five years in duration", "947abeb5-2c90-4900-89b0-9519f6538542"]]}, "157": {"subject": "A substantial shakeup resulting from the trial outcome", "facts": [["might benefit Microsoft significantly", "947abeb5-2c90-4900-89b0-9519f6538542"]]}, "158": {"subject": "Alphabet", "facts": [["has a market value of $2 trillion", "947abeb5-2c90-4900-89b0-9519f6538542"]]}, "159": {"subject": "Apple", "facts": [["has considered building its own search technology", "947abeb5-2c90-4900-89b0-9519f6538542"], ["generated $85 billion in revenue", "947abeb5-2c90-4900-89b0-9519f6538542"]]}, "160": {"subject": "The Justice Department", "facts": [["has sued Apple, Ticketmaster, and Live Nation Entertainment", "947abeb5-2c90-4900-89b0-9519f6538542"]]}, "161": {"subject": "Michael Liedtke", "facts": [["serves as a reporter for The Associated Press, covering technology and various other business topics since the turn of the century.", "947abeb5-2c90-4900-89b0-9519f6538542"]]}, "162": {"subject": "John Doe", "facts": [["maintains Twitter and Instagram profiles", "947abeb5-2c90-4900-89b0-9519f6538542"], ["possesses a Facebook profile", "947abeb5-2c90-4900-89b0-9519f6538542"], ["can be accessed on Twitter, Instagram, and Facebook platforms", "947abeb5-2c90-4900-89b0-9519f6538542"]]}, "163": {"subject": "**Mark Zuckerberg**", "facts": [["faces preliminary charges", "8b662520-f803-4631-a009-d6d33e880828"]]}, "164": {"subject": "**Elon Musk**", "facts": [["facing preliminary charges was reported about", "8b662520-f803-4631-a009-d6d33e880828"]]}, "165": {"subject": "J. Horace McFarland", "facts": [["exists as a global news organization", "8b662520-f803-4631-a009-d6d33e880828"]]}, "166": {"subject": "Melville Stone and Cornelius Van Zandt", "facts": [["dedicates itself to factual reporting", "8b662520-f803-4631-a009-d6d33e880828"]]}, "167": {"subject": "AP's staff of 4,100 employees in more than 100 locations worldwide", "facts": [["provides essential technologies and services necessary for the functioning of the news industry", "8b662520-f803-4631-a009-d6d33e880828"]]}, "168": {"subject": "More than half the world's population", "facts": [["views AP journalism on a daily basis", "8b662520-f803-4631-a009-d6d33e880828"]]}, "169": {"subject": "French authorities", "facts": [["handed preliminary charges to Pavel Durov regarding alleged criminal activity on Telegram", "8b662520-f803-4631-a009-d6d33e880828"], ["prohibited Pavel Durov from departing the country, delaying his departure until further notice by Judge Jean-Luc Gourbin", "8b662520-f803-4631-a009-d6d33e880828"]]}, "170": {"subject": "Pavel Durov", "facts": [["was detained at Le Bourget airport for an ongoing investigation by Judge Jacques Thévenot", "8b662520-f803-4631-a009-d6d33e880828"], ["was ordered to post 5 million euros bail due to the preliminary charges by Judge Fabrice Capelle", "8b662520-f803-4631-a009-d6d33e880828"], ["is obligated to appear at a police station every week, adhering to his bail requirements under Judge Nicolas Champeaux", "8b662520-f803-4631-a009-d6d33e880828"], ["possesses French citizenship", "8b662520-f803-4631-a009-d6d33e880828"], ["was charged with complicity in managing an online platform to facilitate illicit transactions by an organized group, marking his first preliminary charge", "8b662520-f803-4631-a009-d6d33e880828"], ["was being followed by the UAE Foreign Ministry concerning his arrest", "8b662520-f803-4631-a009-d6d33e880828"], ["was co-founded by him and his brother of the messaging application Telegram", "8b662520-f803-4631-a009-d6d33e880828"], ["relinquished ownership rights to VKontakte in 2013", "8b662520-f803-4631-a009-d6d33e880828"], ["said that authorities demanded that a site take down online communities of Russian opposition activists", "8b662520-f803-4631-a009-d6d33e880828"], ["turned down demands from authorities and left Russia", "8b662520-f803-4631-a009-d6d33e880828"]]}, "171": {"subject": "Judge Thierry Perez", "facts": [["released Pavel Durov from detention, ending four days of interrogation", "8b662520-f803-4631-a009-d6d33e880828"]]}, "172": {"subject": "Judge Laurent Goguet", "facts": [["filed preliminary charges against Pavel Durov", "8b662520-f803-4631-a009-d6d33e880828"]]}, "173": {"subject": "Telegram", "facts": [["serves as a medium allegedly used for distributing child sexual abuse material and facilitating drug trafficking", "8b662520-f803-4631-a009-d6d33e880828"], ["faces judicial scrutiny without adequate response, prompting an investigation", "8b662520-f803-4631-a009-d6d33e880828"], ["is popularly utilized in Iran despite the official ban", "8b662520-f803-4631-a009-d6d33e880828"], ["has nearly one billion users worldwide", "8b662520-f803-4631-a009-d6d33e880828"]]}, "174": {"subject": "EUROPOL Investigators", "facts": [["requested information or documents from Telegram, but it refused to provide them when required by law", "8b662520-f803-4631-a009-d6d33e880828"]]}, "175": {"subject": "French Authorities", "facts": [["charged Pavel Durov with complicity in managing an online platform to facilitate illicit transactions by an organized group, marking his first preliminary charge", "8b662520-f803-4631-a009-d6d33e880828"], ["initiate investigations", "8b662520-f803-4631-a009-d6d33e880828"]]}, "176": {"subject": "complicity in managing an online platform to allow illicit transactions by an organized group", "facts": [["can result in sentences of up to 10 years in prison and a fine of €500,000", "8b662520-f803-4631-a009-d6d33e880828"]]}, "177": {"subject": "French Magistrates", "facts": [["have strong reason to believe a crime was committed", "8b662520-f803-4631-a009-d6d33e880828"]]}, "178": {"subject": "David-Olivier Kaminski", "facts": [["serves as the lawyer representing Pavel Durov", "8b662520-f803-4631-a009-d6d33e880828"]]}, "179": {"subject": "Russian Government Officials", "facts": [["claim Durov's arrest is politically driven", "8b662520-f803-4631-a009-d6d33e880828"]]}, "180": {"subject": "The Kremlin", "facts": [["criticizes Russia for its failed attempt to block Telegram", "8b662520-f803-4631-a009-d6d33e880828"]]}, "181": {"subject": "Iran", "facts": [["bans Telegram following prolonged public protests against the government's policies", "8b662520-f803-4631-a009-d6d33e880828"]]}, "182": {"subject": "Ayatollah Ali Khamenei", "facts": [["issues a statement regarding Durov's arrest in France", "8b662520-f803-4631-a009-d6d33e880828"]]}, "183": {"subject": "French President Emmanuel Macron", "facts": [["clarifies Durov's arrest is an unbiased inquiry, unrelated to politics", "8b662520-f803-4631-a009-d6d33e880828"]]}, "184": {"subject": "The French Government", "facts": [["publicly declares its commitment to upholding citizens' rights and freedoms via social media platform X", "8b662520-f803-4631-a009-d6d33e880828"]]}, "185": {"subject": "Dmitry Durov", "facts": [["holds citizenships from Russia, France, the United Arab Emirates, and St. Kitts and Nevis", "8b662520-f803-4631-a009-d6d33e880828"], ["had his request for French consular assistance made by the UAE Foreign Ministry due to his Russian citizenship", "8b662520-f803-4631-a009-d6d33e880828"], ["launched VKontakte, a social media site, in the year 2006", "8b662520-f803-4631-a009-d6d33e880828"]]}, "186": {"subject": "Moscow", "facts": [["assured aid from Moscow to Pavel Durov as a Russian citizen", "8b662520-f803-4631-a009-d6d33e880828"]]}, "187": {"subject": "Kremlin", "facts": [["demanded that Telegram hand over personal data of users who took part in the 2013-2014 popular uprising in Ukraine", "8b662520-f803-4631-a009-d6d33e880828"], ["clamped down on the digital space", "8b662520-f803-4631-a009-d6d33e880828"]]}, "188": {"subject": "Russian people", "facts": [["use Telegram as a convenient way to communicate and share news", "8b662520-f803-4631-a009-d6d33e880828"]]}, "189": {"subject": "Ukrainian media outlets", "facts": [["rely on Telegram as a popular source of news", "8b662520-f803-4631-a009-d6d33e880828"]]}, "190": {"subject": "Western governments officials", "facts": [["criticized Telegram for a lack of content moderation", "8b662520-f803-4631-a009-d6d33e880828"]]}, "191": {"subject": "Barbara Surk", "facts": [["reported from Nice, France", "8b662520-f803-4631-a009-d6d33e880828"]]}, "192": {"subject": "The Associated Press news organization", "facts": [["was founded in 1846 by its founders", "8b662520-f803-4631-a009-d6d33e880828"], ["operates independently as a global news organization", "8b662520-f803-4631-a009-d6d33e880828"], ["produces journalism seen by more than half the world's population every day", "8b662520-f803-4631-a009-d6d33e880828"]]}, "193": {"subject": "Jeff Bezos", "facts": [["operates Amazon with millions of users worldwide", "8b662520-f803-4631-a009-d6d33e880828"]]}, "194": {"subject": "Mark Zuckerberg", "facts": [["has gained popularity among young adults through Facebook", "8b662520-f803-4631-a009-d6d33e880828"]]}, "195": {"subject": "Elon Musk", "facts": [["facilitates connections between family and friends on Twitter", "8b662520-f803-4631-a009-d6d33e880828"]]}}}