{"_default": {"1": {"subject": "Dolphin", "facts": [["can potentially balance and perfect the remaining four spiritual faculties", "22339e04-9979-4cc7-a844-d3600b813fa1"], ["knows what is as it is right now, being very clear about our human reality", "22339e04-9979-4cc7-a844-d3600b813fa1"]]}, "2": {"subject": "Faith, Energy, Mindfulness, Concentration, Wisdom", "facts": [["identify the five spiritual faculties", "22339e04-9979-4cc7-a844-d3600b813fa1"], ["involve faith in morality, exert energy for clear living, be mindful of thoughts, increase concentration, learn wisdom from experience", "22339e04-9979-4cc7-a844-d3600b813fa1"]]}, "3": {"subject": "Kamala Devi Harris", "facts": [["was born on October 20, 1964.", "42fb2472-0876-4dbc-a470-2a0676f38b89"], ["serves as the 49th vice president of the United States since 2021, alongside President Joe Biden.", "42fb2472-0876-4dbc-a470-2a0676f38b89"], ["is the first female vice president in U.S. history.", "42fb2472-0876-4dbc-a470-2a0676f38b89"], ["is also the highest-ranking female official in U.S. history.", "42fb2472-0876-4dbc-a470-2a0676f38b89"], ["is the first African American and the first Asian American vice president.", "42fb2472-0876-4dbc-a470-2a0676f38b89"], ["served as a U.S. senator from California between 2017 and 2021.", "42fb2472-0876-4dbc-a470-2a0676f38b89"], ["was the attorney general of California prior to her role as senator.", "42fb2472-0876-4dbc-a470-2a0676f38b89"], ["is currently the Democratic Party's presidential nominee for the 2024 U.S. presidential election.", "42fb2472-0876-4dbc-a470-2a0676f38b89"]]}, "4": {"subject": "Kamala D. Harris", "facts": [["holds the position of Vice President of the United States", "817e3285-97bc-4815-9ce9-daab22b56a7f"], ["served as District Attorney of San Francisco, Attorney General of California, and a United States Senator prior to her role as Vice President", "817e3285-97bc-4815-9ce9-daab22b56a7f"], ["made history as the first woman, the first Black American, and the first South Asian American elected Vice President on January 20, 2021", "817e3285-97bc-4815-9ce9-daab22b56a7f"], ["promoted opportunity, delivered for families, and safeguarded fundamental freedoms throughout the country as Vice President", "817e3285-97bc-4815-9ce9-daab22b56a7f"], ["championed women's reproductive freedom, gun violence prevention, voting rights, clean water, and clean air initiatives", "817e3285-97bc-4815-9ce9-daab22b56a7f"], ["represents the United States abroad through numerous foreign trips involving over 150 world leaders in her capacity as Vice President", "817e3285-97bc-4815-9ce9-daab22b56a7f"]]}, "5": {"subject": "Biden-Harris administration", "facts": [["achieved a record number of jobs, maintained low unemployment rates, and fostered small business growth", "817e3285-97bc-4815-9ce9-daab22b56a7f"]]}}}